/* 
 Localizable.strings
 BOINCMenubar
 */
 
// NSLocalizedString(@"string", @"stringComment")

////////////////////////////////////////////////////////////////////
// strings for 

//
////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
// strings for misc

"YES" = "YES";
"NO" = "NO";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the about window


// application version
"Version %@" = "Version %@";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the labels of the Host portion of the main menu

// Note: the label switches between these two strings
// Host menu label
"Host:" = "Host:";
// No Host Connected menu label
"No Host Connected" = "No Host Connected";

// Note: the label switches between these two strings
// Suspend Network Access menu label
"Suspend Network Access" = "Suspend Network Access";
// Resume Network Access menu label
"Resume Network Access" = "Resume Network Access";

// The tooltip for the list of hosts the user has (part of the host submenu)
// the %@ is the user's name for the host
// the two \" are used to add " around the name of the host
"Change the status menu to show information for \"%@\"" = "Change the status menu to show information for \"%@\"";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the labels of the project's credit menu

// Total Credit menu label
"Total Credit:" = "Total Credit:";

// Host Credit menu label
"Host Credit:" = "Host Credit:";

// Recent Average Credit (RAC) menu label
"RAC:" = "RAC:";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the labels of the project's account submenu

// Account menu label
"Account:" = "Account:";

// Team menu label
"Team:" = "Team:";

// Host Venue menu label
"Host Venue:" = "Host Venue:";

// Tasks menu label
"Tasks:" = "Tasks:";

// Running label   example: Tasks: 15 (4 Running)
"Running" = "Running";

// remaining Time Estimate menu label
"Time Estimate:" = "Time Estimate:";

// the next four, the # will be the number (of days, hours, minutes, seconds) 
// then put the initial before/after it and a space (or other delimiter) based on your language/local
// keep it short

// Day format with initial (time)
"#d " = "#d ";

// Hour format with initial (time)
"#h " = "#h ";

// Minute format with initial (time)
"#m " = "#m ";

// Second format with initial (time)
"#s" = "#s";

// No time, something to represent that there are no tasks that have time left
"--" = "--";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the labels of actions in the project's account submenu

// Note: the label switches between these two strings
// Suspend Project menu label
"Suspend Project" = "Suspend Project";
// Resume Project menu label
"Resume Project" = "Resume Project";

// Note: the label switches between these two strings
// Stop Downloading New Tasks menu label
"Stop Downloading New Tasks" = "Stop Downloading New Tasks";
// Allow Downloading New Tasks menu label
"Allow Downloading New Tasks" = "Allow Downloading New Tasks";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the Add Host Preference Sheet

// default name when adding a new host
"Remote Computer" = "Remote Computer";


// default name for the local host
"This Computer" = "This Computer";

//
////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////
// strings for the Project's Preference view

// default name for the source list category for dealing with projects that are not in the All Projects List
"Other Projects" = "Other Projects";

// default name for the view that allows users to attach to projects that are not in the All Projects List
"Join unlisted project" = "Join unlisted project";

//
////////////////////////////////////////////////////////////////////




// NSLocalizedString(@"string", @"stringComment")

////////////////////////////////////////////////////////////////////
/* strings for the BOINC Preference view (only used when not editing the preferences)
 These strings are shown to indicate that the user can't edit them in the program (they come from the project's website)
 Look at the labels for Computing Preferences on a project's website for help
*/

// Computing allowed
// BOINC Web: Suspend work while computer is in use?
// %@ is number of minutes the computer has to be idle before it will start running the project applications again
// Note: the label switches between these two strings
"While computer is in use." = "While computer is in use.";
"Only after computer has been idle for %@ minutes." = "Only after computer has been idle for %@ minutes.";

// Computing allowed
// BOINC Web: Suspend work if no mouse/keyboard activity in last
// %@ is number of minutes that project applications can run, then they will be stopped so that the computer can sleep
// Note: cannot be set/changed from BOINC Menubar, only from a project's web site
// Note: the label switches between these two strings
"Only if keyboard/mouse activity in last %@ minutes." = "Only if keyboard/mouse activity in last %@ minutes.";
"Not suspended based on lack of keyboard/mouse activity." = "Not suspended based on lack of keyboard/mouse activity.";

// Computing allowed
// BOINC Web: Suspend work while computer is on battery power?
// %@ is "YES" or "NO"
"While computer is on batteries: %@." = "While computer is on batteries: %@.";


// Processor options
// BOINC Web: Switch between applications every
// %@ is the maximum time interval (in minutes) that boinc allow applications to run before changing them based on the users resource share settings
"Switch between applications every %@ minutes." = "Switch between applications every %@ minutes.";

// Processor options
// BOINC Web: On multiprocessors, use at most
// %@ is the percentage of how many processors the computer has that will be used to run boinc applications
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"On multiprocessor systems, use at most %@%% of processors." = "On multiprocessor systems, use at most %@%% of processors.";

// Processor options
// BOINC Web: Use at most 100 percent of CPU time
// %@ is the percentage of time that boinc applications will be allow to run
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"Use at most %@%% CPU time." = "Use at most %@%% CPU time.";


// General Network Options
// BOINC Web: Maximum download rate:
// Note: the label switches between these two strings
// %@ is the download rate, zero means no limit
"Maximum download rate: %@ Kbytes/sec" = "Maximum download rate: %@ Kbytes/sec";
"Maximum download rate: no limit" = "Maximum download rate: no limit";

// General Network Options
// BOINC Web: Maximum upload rate:
// Note: the label switches between these two strings
// %@ is the upload rate, zero means no limit
"Maximum upload rate: %@ Kbytes/sec" = "Maximum upload rate: %@ Kbytes/sec";
"Maximum upload rate: no limit" = "Maximum upload rate: no limit";

// General Network Options
// BOINC Web: Computer is connected to the Internet about every 
// Note: the label switches between these two strings
// %@ is number of days, zero is always on
"Connect about every %@ days." = "Connect about every %@ days.";
"Connection is always on." = "Connection is always on.";

// General Network Options
// BOINC Web: Maintain enough work for an additional
// %@ is number of days for the buffer
"Additional work buffer of %@ days." = "Additional work buffer of %@ days.";

// General Network Options
// BOINC Web: Skip image file verification?
// %@ is "YES" or "NO"
"Skip image file verification: %@" = "Skip image file verification: %@";

// General Network Options
// BOINC Web: Confirm before connecting to Internet? 
// %@ is "YES" or "NO"
"Confirm before connecting to internet: %@" = "Confirm before connecting to internet: %@";

// General Network Options
// BOINC Web: Disconnect when done?
// %@ is "YES" or "NO"
"Disconnect when done: %@" = "Disconnect when done: %@";


// Disk usage
// BOINC Web: Use at most     GB disk space
"Use at most %@ Gigabytes disk space." = "Use at most %@ Gigabytes disk space.";

// Disk usage
// BOINC Web: Leave at least     GB disk space free
"Leave at least %@ Gigabytes disk space free." = "Leave at least %@ Gigabytes disk space free.";

// Disk usage
// BOINC Web: Use at most    % of total disk space
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"Use at most %@%% of total disk space." = "Use at most %@%% of total disk space.";

// Disk usage
// BOINC Web: Write to disk at most every
"Write to disk at most every %@ seconds." = "Write to disk at most every %@ seconds.";

// Disk usage
// BOINC Web: Use at most    % of page file (swap space)
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"Use at most %@%% of page file (swap space)." = "Use at most %@%% of page file (swap space).";


// Memory usage
// BOINC Web: Use at most    % of memory when computer is in use
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"Use at most %@%% of memory when computer is in use." = "Use at most %@%% of memory when computer is in use.";

// Memory usage
// BOINC Web: Use at most    % of memory when computer is not in use
// the %% is needed to get the percent symbol in the string, so make sure to use two %'s if you use that symbol
"Use at most %@%% of memory when computer is idle." = "Use at most %@%% of memory when computer is idle.";

// Memory usage
// BOINC Web: Leave applications in memory while suspended?
// %@ is "YES" or "NO"
"Leave applications in memory while suspended: %@" = "Leave applications in memory while suspended: %@";


// label for when the web preferences were last updated (needs some sort of space at the end)
"Last Update: " = "Last Update: ";

//
////////////////////////////////////////////////////////////////////



